//// @file
//
// TODO: Brief Description of UEFI Driver MyWizardDriver
//  
// TODO: Detailed Description of UEFI Driver MyWizardDriver
//
// TODO: Copyright for UEFI Driver MyWizardDriver
//  
// TODO: License for UEFI Driver MyWizardDriver
// 
////

#langdef en "English"

#string STR_SAMPLE_FORM_SET_TITLE      #language en  "My Wizard Driver Sample Formset"
#string STR_SAMPLE_FORM_SET_HELP       #language en  "Help for Sample Formset"
#string STR_SAMPLE_FORM1_TITLE         #language en  "My Wizard Driver"



#string STR_SUBTITLE_TEXT              #language en "My Wizard Driver Configuration"

#string STR_SUBTITLE_TEXT2             #language en "Device XYZ Configuration"


#string STR_CHECK_BOX_PROMPT           #language en "Enable My XYZ Device"
                                       
#string STR_CHECK_BOX_HELP             #language en "This is the help message for the enable My XYZ device. Check this box to enable this device."
                                       
#string STR_STANDARD_DEFAULT_PROMPT    #language en "Standard Default"

#string STR_STANDARD_DEFAULT_PROMPT_RESET    #language en "Reset to Standard Default"

#string STR_STANDARD_DEFAULT_HELP      #language en "This will reset all the Questions to their standard default value"

#string STR_ONE_OF_PROMPT              #language en "Select Base Address"

#string STR_ONE_OF_HELP                #language en "Select a Base address of 400, 480 or 500 Hex.  Values 0,1 or 2(default) is stored in the NVRAM Data" 

#string STR_ONE_OF_TEXT1               #language en "400 Hex"

#string STR_ONE_OF_TEXT2               #language en "480 Hex"

#string STR_ONE_OF_TEXT3               #language en "500 Hex"

#string STR_MY_STRING_PROMPT           #language en "Name of Configuration"

#string STR_MY_STRING_HELP             #language en "Enter a name for this configuration. This string can is 3 to 20 characters"

#string STR_DATA_HEX_PROMPT            #language en "Enter ZY Base (Hex)"

#string STR_NUMERIC_HELP               #language en "This is the help for entering a Base address in Hex. The valid range in this case is from 0 to 250."

